<div class="container">
<div class="row">
  <div class="span4">
    <img src="/assets/img/mm_logo.jpg" class="img-rounded mmLogo">
    Дистанционный электронный образовательный ресурс АЛГЕБРАИЧЕСКИЙ ПРОЦЕССОР &laquo;НИУ &laquo;МЭИ&raquo; поддерживает теоретическое и практическое изучение свойств и алгоритмов конечных групп, колец, полей и основанных на этих алгебраических структурах средств защиты информации, в частности, криптографических систем и протоколов. Он отличается широким набором изучаемых алгебраических структур и позволяет выполнять вычисления в них с использованием составляемых  в интерактивном режиме и программ на основе библиотеки классов MPEI AAL (MPEI Algebraic Abstractions Library). Предназначен для использования при выполнении лабораторных работ, курсовых и дипломных проектов, выпускных работ бакалавров и других видов самостоятельной работы, а также для демонстрации изучаемых алгебраических аспектов дисциплины при чтении лекций.
  </div>
  <div class="span8">
    <dl class="">
      <dt></dt>
      <dd>Дистанционный электронный образовательный ресурс АЛГЕБРАИЧЕСКИЙ ПРОЦЕССОР &laquo;НИУ &laquo;МЭИ&raquo; разработан при финансовой поддержке РФФИ, проект № 11-01-00792а в развитие локальной версии, разработанной в соответствии с государственной программой Инновационные технологии обучения на кафедре математического моделирования Национального исследовательского университета &laquo;МЭИ&raquo;.</dd>
      <dt>Программное обеспечение</dt>
      <dd>Свидетельство о государственной регистрации программы для ЭВМ № 2012617762 MPEI Processor - программа интерактивного исполнения алгебраических операций различных алгебраических структур на основе алгебраической библиотеки MPEI AAL <em>//Фролов А.Б., Белова А.Ю., Морозов С.В., Винников А.М., Волокитин М.В., Зимаков О.В., Мамонтов А.И., Чернышева Н.В.</em> Дата регистрации 28 августа 2012 г.<br/>
Свидетельство о государственной регистрации программы для ЭВМ № 2013615738 - Дистанционный информационный ресурс вычислений с использованием алгебраических библиотек <em>//Фролов А.Б., Винников А.М.</em> Дата регистрации 19 июня 2013 г.</em></dd>
      
      <dt>Научный руководитель разработки</dt> 
      <dd>д.т.н., профессор Фролов Александр Борисович.</dd>

      <dt>Ответственный исполнитель</dt>
      <dd>магистр &laquo;НИУ &laquo;МЭИ&raquo; Винников Александр Михайлович</dd>

      <dt>Авторские права</dt>
      <dd>Все права на размножение и распространение в любой форме остаются за разработчиком.</dd>

      
      <dt>Авторы:</dt>
      <dd>Фролов А.Б. (Идея и архитектура Алгебраического процессора и прототипа. Теоретическое обоснование и текст ресурса),  Винников А.М. (концепция и программное обеспечение дистанционного доступа), Гашков С.Б. (текст ресурса)</dd>
      
      <dt>Заимствования:</dt>
      <dd>Библиотекa эллиптической криптографии и арифметики больших чисел <a href="http://certivox.com/">M.I.R.A.C.L.</a>, библиотека алгоритмов целочисленной факторизации <a href="http://www.boo.net/~jasonp/qs.html">msieve</a>, метод эллиптических кривых для факторизации(gmp-ecm), таблицы факторизации проекта John Brillhart D.H., Lehmer, J.L. Selfridge, Bryant Tuckerman и S.S. Wagstaff, Jr. <em>Factorisations of b^n±1, b=2,3,6,7,10,11 up to high powers. Amer. Math. Soc., Providence, Rhode Island, 2002</em>. В разработке дистанционной версии использованы: веб-фреймворк <a href="http://bottlepy.org/">bottle.py</a>, <a href="http://twitter.github.com/bootstrap/">ui-элементы Twitter Bootstrap</a>.<br/>
      Прототипами служили локальная версия алгебраического процессора MPEI PROCCESSOR, алгебраическая библиотека MSUMPEI, разработанная в МГУ им. М.В.Ломоносова и МЭИ(ТУ) в 1999-2003 г.г. под руководством А.А. Болотова, С.Б. Гашкова, А.Б. Фролова и А.А. Часовских студентами МГУ и МЭИ.</dd>

      <dt>Библиографическое описание:</dt>

      <dd><strong>Фролов, Александр Борисович.</strong> Дистанционный алгебраический процессор &laquo;НИУ &laquo;МЭИ&raquo; [Электронный ресурс]: для студентов и аспирантов всех специальностей АВТИ <em>//А.Б.Фролов, А.М.Винников, С.Б. Гашков. - М.: Издательский дом МЭИ, 2013.</em></dd>
    </dl>
  </div>
</div>



%rebase layout title='Алгебраический процессор МЭИ - Авторы', path='/authors', is_user=is_user, is_admin=False
