<div class="container">
<div class="row">
  <div class="span4">
    <img src="/assets/img/mm_logo.jpg" class="img-rounded mmLogo">
    Электронный образовательный ресурс АЛГЕБРАИЧЕСКИЙ ПРОЦЕССОР поддерживает теоретическое и практическое изучение свойств и алгоритмов конечных групп, колец, полей и основанных на этих алгебраических структурах средств защиты информации, в частности, криптографических систем и протоколов. Он отличается широким набором изучаемых алгебраических структур и позволяет выполнять вычисления в них как в интерактивном режиме, так и путем разработки и исследования программ на основе библиотеки классов.  Предназначен для использования при выполнении лабораторных работ, курсовых и дипломных проектов, выпускных работ бакалавров и других видов самостоятельной работы, а также для демонстрации изучаемых алгебраических аспектов дисциплины  при чтении лекций.
  </div>
  <div class="span8">
    <dl class="">
      <dt></dt>
      <dd>Электронный образовательный ресурс АЛГЕБРАИЧЕСКИЙ ПРОЦЕССОР разработан в соответствии с государственной программой Инновационные технологии обучения на кафедре математического моделирования Московского энергетического института (технического университета).</dd>

      <dt>Научный руководитель разработки</dt> 
      <dd>д.т.н., профессор Фролов Александр Борисович.</dd>

      <dt>Ответственные исполнители</dt>  Белова Александра Юрьевна, Морозов Сергей Вячеславович.

      <dd>Разработка осуществлена с учетом опыта создания библиотеки MSUMPEI и Алгебраического процессора на ее основе, разработанных в МГУ им. М.В.Ломоносова и МЭИ(ТУ) в 1999-2003 г.г. под руководством А.А. Болотова, С.Б. Гашкова, А.Б. Фролова и А.А. Часовских студентами МГУ и МЭИ.</dd>

      <dt>Авторские права</dt>
      <dd>Все права на размножение и распространение в любой форме остаются за разработчиком.<br/>
      Нелегальное копирование и использование данного ресурса запрещено.</dd>

      <dt>Авторы:</dt>
      <dd>Фролов А.Б. (Идея и архитектура Алгебраического процессора и прототипа. Теоретическое обоснование и текст ресурса), Гашков С.Б. (текст ресурса), Белова А.Ю. (программное обеспечение), Морозов С.В. (программное обеспечение), Жебет С.Ю. (программное обеспечение и текст ресурса Multiplier), Панкин А.В. (программное обеспечение ресурса SymmetricStream), Щуров И.И. (программное обеспечение и текст ресурсов KDP, Kerberos KDP, User KDP).
      <br/>
      В разработке программного обеспечения ЭОР и прототипа также участвовали  студенты МЭИ: Дроздов А.Б. (А-14-97), Артемьева П.И. (А-14-99), Мамонтов Ал.И.(А-14-00),  Волокитин М.В. (А-14-01), Шилкин С.О. (А-14-02), Панкин А.В. (А-14-02), Чернышева Н.В. (А-14-02), Болдырев А.Г. (А-14-03), Денисов М.А. (А-14-03). Разработка дистанционной версии: Зимаков О.(А-14-06), Винников А.М.(А-14-07)</dd>
      
      <dt>Заимствования:</dt>
      <dd><a href="http://certivox.com/">M.I.R.A.C.L.</a>, <a href="http://www.boo.net/~jasonp/qs.html">msieve</a>, gmp-ecm. В разработке дистанционной версии использованы: <a href="http://bottlepy.org/">bottle.py</a>, <a href="http://twitter.github.com/bootstrap/">ui-элементы твиттера</a>, прототипом служил сайт <a href="http://www.codecademy.com/">Codeacademy.com</a></dd>
      
      <dt>Библиографическое описание:</dt>

      <dd><strong>Фролов, Александр Борисович.</strong> Алгебраический процессор [Электронный ресурс]: для студентов и аспирантов всех специальностей АВТИ <em>/А.Б.Фролов, С.Б. Гашков, C.Ю. Жебет, А.Ю.Белова, С.В.Морозов, И.И. Щуров,. - М.: Издательский дом МЭИ, 2007.</em></dd>
    </dl>
  </div>
</div>



%rebase layout title='Алгебраический процессор МЭИ - Авторы', path='/authors', is_user=is_user, is_admin=False
